Suerzong/AI-Native-Learning-OS/courses/ti-board/code/layer-3-application/sign-recognition/empty_LP_MSPM0G3507_nortos_ticlang/generated_syscfg/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000



/* Defines for UART_Speaker */
#define UART_Speaker_INST                                                  UART1
#define UART_Speaker_INST_IRQHandler                            UART1_IRQHandler
#define UART_Speaker_INST_INT_IRQN                                UART1_INT_IRQn
#define GPIO_UART_Speaker_RX_PORT                                          GPIOA
#define GPIO_UART_Speaker_TX_PORT                                          GPIOA
#define GPIO_UART_Speaker_RX_PIN                                  DL_GPIO_PIN_18
#define GPIO_UART_Speaker_TX_PIN                                  DL_GPIO_PIN_17
#define GPIO_UART_Speaker_IOMUX_RX                               (IOMUX_PINCM40)
#define GPIO_UART_Speaker_IOMUX_TX                               (IOMUX_PINCM39)
#define GPIO_UART_Speaker_IOMUX_RX_FUNC                IOMUX_PINCM40_PF_UART1_RX
#define GPIO_UART_Speaker_IOMUX_TX_FUNC                IOMUX_PINCM39_PF_UART1_TX
#define UART_Speaker_BAUD_RATE                                            (9600)
#define UART_Speaker_IBRD_32_MHZ_9600_BAUD                                 (208)
#define UART_Speaker_FBRD_32_MHZ_9600_BAUD                                  (21)
/* Defines for UART_OpenMV */
#define UART_OpenMV_INST                                                   UART3
#define UART_OpenMV_INST_IRQHandler                             UART3_IRQHandler
#define UART_OpenMV_INST_INT_IRQN                                 UART3_INT_IRQn
#define GPIO_UART_OpenMV_RX_PORT                                           GPIOB
#define GPIO_UART_OpenMV_TX_PORT                                           GPIOB
#define GPIO_UART_OpenMV_RX_PIN                                    DL_GPIO_PIN_3
#define GPIO_UART_OpenMV_TX_PIN                                    DL_GPIO_PIN_2
#define GPIO_UART_OpenMV_IOMUX_RX                                (IOMUX_PINCM16)
#define GPIO_UART_OpenMV_IOMUX_TX                                (IOMUX_PINCM15)
#define GPIO_UART_OpenMV_IOMUX_RX_FUNC                 IOMUX_PINCM16_PF_UART3_RX
#define GPIO_UART_OpenMV_IOMUX_TX_FUNC                 IOMUX_PINCM15_PF_UART3_TX
#define UART_OpenMV_BAUD_RATE                                             (9600)
#define UART_OpenMV_IBRD_32_MHZ_9600_BAUD                                  (208)
#define UART_OpenMV_FBRD_32_MHZ_9600_BAUD                                   (21)





/* Port definition for Pin Group GPIO_OLED */
#define GPIO_OLED_PORT                                                   (GPIOB)

/* Defines for PIN_SDA: GPIOB.0 with pinCMx 12 on package pin 47 */
#define GPIO_OLED_PIN_SDA_PIN                                    (DL_GPIO_PIN_0)
#define GPIO_OLED_PIN_SDA_IOMUX                                  (IOMUX_PINCM12)
/* Defines for PIN_SCL: GPIOB.16 with pinCMx 33 on package pin 4 */
#define GPIO_OLED_PIN_SCL_PIN                                   (DL_GPIO_PIN_16)
#define GPIO_OLED_PIN_SCL_IOMUX                                  (IOMUX_PINCM33)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_UART_Speaker_init(void);
void SYSCFG_DL_UART_OpenMV_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
